BitOps> set a = 0101011010100101110001111111111010101010
BitOps> set b = 1010101111010101010101000101111110101011
BitOps> show a
0000000000000000000000000101011010100101110001111111111010101010
BitOps> show b
0000000000000000000000001010101111010101010101000101111110101011
BitOps> c = a & b
0000000000000000000000000000001010000101010001000101111010101010
BitOps> d = c | a
0000000000000000000000000101011010100101110001111111111010101010
BitOps> e = ~ d
1111111111111111111111111010100101011010001110000000000101010101
BitOps> d = d << 5
0000000000000000000010101101010010111000111111111101010101000000
BitOps> d = d >> 5
0000000000000000000000000101011010100101110001111111111010101010
BitOps> 
